Revit 2026 API

# BuiltInFailuresToggleViewFailures Class

---

Failures about ToggleView.

SystemObject Autodesk.Revit.DBBuiltInFailuresToggleViewFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class ToggleViewFailures
```
```vb
Public NotInheritable Class ToggleViewFailures
```
```cpp
public ref class ToggleViewFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type ToggleViewFailures = class end
```

The BuiltInFailuresToggleViewFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | LoseSavedOrientation | The stored orientation will be lost. |

#### Reference

Autodesk.Revit.DB Namespace